tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
tap "shopify/shopify"
# OpenGL Extension Wrangler Library
brew "glew"
# Multi-platform library for OpenGL applications
brew "glfw"
# Configurable static site generator
brew "hugo"
# Interactive computing in Python
brew "ipython"
# Platform built on V8 to build network applications
brew "node", link: false
# Interactive environments for writing and running code
brew "jupyterlab"
# C driver for MongoDB
brew "mongo-c-driver"
# Object-relational database system
brew "postgresql", restart_service: true
# Object-relational database system
brew "postgresql@11"
# Ruby version manager
brew "rbenv"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# JavaScript package manager
brew "yarn"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# The MongoDB Command Line Interface (mongocli) is a tool for managing your MongoDB cloud services, like MongoDB Atlas, MongoDB Cloud Manager, and MongoDB Ops Manager.
brew "mongodb/brew/mongocli"
# Theme Kit is a tool kit for manipulating shopify themes
brew "shopify/shopify/themekit"
